app/views/books/index.html.erb

SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
  <div class="float-wrapper">
    <p class="comment-count">コメント数<%= book.book_comments.count %></p>