app/controllers/book_comments_controller.rb

	def create
		@book = Book.find(params[:book_id])
    	@book_comment = BookComment.new(book_comment_params)
    	@book_comment.book_id = @book.id
    	@book_comment.user_id = current_user.id
    	if @book_comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "hjfhhn"], ["user_id", 1], ["book_id", 2], ["created_at", "2020-10-05 10:28:02.207552"], ["updated_at", "2020-10-05 10:28:02.207552"]]