app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "aaa"], ["body", "aaaa"], ["user_id", 1], ["created_at", "2020-10-05 01:12:47.718607"], ["updated_at", "2020-10-05 01:12:47.718607"]]
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    # ２. データをデータベースに保存するためのsaveメソッド実行
    if @book.save

SELECT "books".* FROM "books"
---
  def index
    @users = User.all
    @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @books = Book.new
    @book = Book.find(params[:id])