app/controllers/favorites_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["book_id", 1], ["created_at", "2020-10-06 00:30:01.030509"], ["updated_at", "2020-10-06 00:30:01.030509"]]
---
	def create
		@book = Book.find(params[:book_id])
    	@favorite = current_user.favorites.new(book_id: @book.id)
    	@favorite.save